In [1]:
import pandas as pd
import numpy as np

In [2]:
labels = ['a', 'b', 'c']
my_data = [1, 2, 3]
arr = np.array(my_data)
d = {'a' : 1, 'b' : 2, 'c' : 3}

In [3]:
pd.Series(data = my_data)

0    1
1    2
2    3
dtype: int64

In [4]:
pd.Series(data = my_data, index = labels)

a    1
b    2
c    3
dtype: int64

In [5]:
pd.Series(my_data, labels)

a    1
b    2
c    3
dtype: int64

In [6]:
pd.Series(arr)

0    1
1    2
2    3
dtype: int32

In [7]:
pd.Series(d)

a    1
b    2
c    3
dtype: int64

In [8]:
ser1 = pd.Series([1, 2, 3, 4, 5], ['A', 'B', 'C', 'D', 'E'])
print(ser1)

ser2 = pd.Series([1, 1, 1, 1, 1], ['A', 'B', 'C', 'E', 'F'])
print(ser2)

A    1
B    2
C    3
D    4
E    5
dtype: int64
A    1
B    1
C    1
E    1
F    1
dtype: int64

In [9]:
ser1 + ser2

A    2.0
B    3.0
C    4.0
D    NaN
E    6.0
F    NaN
dtype: float64

NaN when index not present in both

DATAFRAME

In [10]:
from numpy.random import randn

In [11]:
np.random.seed(101)

In [12]:
df = pd.DataFrame(randn(5, 4), [1, 2, 3, 4, 5], ['A', 'B', 'C', 'D'])

In [13]:
df

          A         B         C         D
1  2.706850  0.628133  0.907969  0.503826
2  0.651118 -0.319318 -0.848077  0.605965
3 -2.018168  0.740122  0.528813 -0.589001
4  0.188695 -0.758872 -0.933237  0.955057
5  0.190794  1.978757  2.605967  0.683509

In [14]:
df[['A', 'B']]

          A         B
1  2.706850  0.628133
2  0.651118 -0.319318
3 -2.018168  0.740122
4  0.188695 -0.758872
5  0.190794  1.978757

In [15]:
df['new'] = [1, 2, 3, 4, 5]
print(df)

print(df.drop(['new', 'A'], axis = 1))

          A         B         C         D  new
1  2.706850  0.628133  0.907969  0.503826    1
2  0.651118 -0.319318 -0.848077  0.605965    2
3 -2.018168  0.740122  0.528813 -0.589001    3
4  0.188695 -0.758872 -0.933237  0.955057    4
5  0.190794  1.978757  2.605967  0.683509    5
          B         C         D
1  0.628133  0.907969  0.503826
2 -0.319318 -0.848077  0.605965
3  0.740122  0.528813 -0.589001
4 -0.758872 -0.933237  0.955057
5  1.978757  2.605967  0.683509

In [16]:
df

          A         B         C         D  new
1  2.706850  0.628133  0.907969  0.503826    1
2  0.651118 -0.319318 -0.848077  0.605965    2
3 -2.018168  0.740122  0.528813 -0.589001    3
4  0.188695 -0.758872 -0.933237  0.955057    4
5  0.190794  1.978757  2.605967  0.683509    5

In [17]:
df.drop(['new', 'A'], axis = 1, inplace = True)

In [18]:
df

          B         C         D
1  0.628133  0.907969  0.503826
2 -0.319318 -0.848077  0.605965
3  0.740122  0.528813 -0.589001
4 -0.758872 -0.933237  0.955057
5  1.978757  2.605967  0.683509

In [19]:
df.loc[1]

B    0.628133
C    0.907969
D    0.503826
Name: 1, dtype: float64

In [20]:
df.iloc[1]

B   -0.319318
C   -0.848077
D    0.605965
Name: 2, dtype: float64

In [21]:
df.loc[[1, 2], ['B', 'D']]

          B         D
1  0.628133  0.503826
2 -0.319318  0.605965

In [22]:
df.iloc[1:3, 1:3]

          C         D
2 -0.848077  0.605965
3  0.528813 -0.589001

In [23]:
df > 0

       B      C      D
1   True   True   True
2  False  False   True
3   True   True  False
4  False  False   True
5   True   True   True

In [24]:
booldf = df > 0

In [25]:
df[booldf]

          B         C         D
1  0.628133  0.907969  0.503826
2       NaN       NaN  0.605965
3  0.740122  0.528813       NaN
4       NaN       NaN  0.955057
5  1.978757  2.605967  0.683509

In [26]:
df[df>0]

          B         C         D
1  0.628133  0.907969  0.503826
2       NaN       NaN  0.605965
3  0.740122  0.528813       NaN
4       NaN       NaN  0.955057
5  1.978757  2.605967  0.683509

In [27]:
df[df['B'] < 0]

          B         C         D
2 -0.319318 -0.848077  0.605965
4 -0.758872 -0.933237  0.955057

In [31]:
df["new_index"] = 'A B C D E '.split()

In [37]:
df.set_index("new_index", inplace = True)

In [38]:
df

                  B         C         D
new_index
A          0.628133  0.907969  0.503826
B         -0.319318 -0.848077  0.605965
C          0.740122  0.528813 -0.589001
D         -0.758872 -0.933237  0.955057
E          1.978757  2.605967  0.683509

In [40]:
df.reset_index(inplace = True)

In [41]:
df

  new_index         B         C         D
0         A  0.628133  0.907969  0.503826
1         B -0.319318 -0.848077  0.605965
2         C  0.740122  0.528813 -0.589001
3         D -0.758872 -0.933237  0.955057
4         E  1.978757  2.605967  0.683509

Multi heirarchy index

In [42]:
outside = 'G1 G1 G1 G2 G2 G2'.split()

In [43]:
inside = [1, 2, 3, 1, 2, 3]

In [44]:
hier_index = list(zip(outside, inside))

In [45]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [46]:
df = pd.DataFrame(randn(6, 2), hier_index, ['A', 'B'])

In [48]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [51]:
df.loc['G1'].loc[2, 'A']

-1.7060859307350775

In [52]:
df.xs(1)

KeyError: 1